//将字符串中除了字符串前导*号之外的其它*号全部删除
#include<stdio.h>
int main()
{
    char str[80];
    //------------请在以下区域补充你的代码----------------
    char* p, * q;
    int i;
    gets(str);
    for (i = 0; str[i] == '*'; i++) ;

    p = q = &str[i];
    for (; *p != 0; )
    {
        if (*p != '*')
        {
            *q = *p;
            q++;
        }
        p++;
    }
    *q = '\0';

    //----------------------------------------------------------------------
    puts(str);

    return 0;
}
